app/views/painel/products/new.html.erb

            <%= f.label :category_id, "Categoria do Produto" , class: "control-label form-label" %>
            <%= collection_select(:product, :category_id, Category.all, :id, :name, { :prompt => "Selecione uma categoria" }, { :class=>'form-control'}) %>
---
SELECT "categories".* FROM "categories"