app/views/painel/clients/index.html.erb

                  <td><%= p.email %></td>
                  <td><%= p.sale.count %></td>
---
SELECT COUNT(*) FROM "sales" WHERE "sales"."client_id" = ?  [["client_id", 1]]