app/views/painel/dashboard/index.html.erb

SELECT "categories".* FROM "categories"
---
                <%= f.label :category_id, "Categoria do Produto" , class: "control-label form-label" %>
                <%= collection_select(:product, :category_id, Category.all, :id, :name, { :prompt => "Selecione uma categoria" }, { :class=> 'form-control'}) %>

SELECT "payments".* FROM "payments"
---
                <%= f.label :payment_id, "Forma de Pagamento" , class: "control-label form-label" %>
                <%= collection_select(:sale, :payment_id, Payment.all, :id, :name, { :prompt => "Selecione uma forma de pagamento" }, { :class=>'form-control'}) %>

SELECT "clients".* FROM "clients"
---
                <%= f.label :client_id, "Cliente" , class: "control-label form-label" %>
                <%= collection_select(:sale, :client_id, Client.all, :id, :name, { :prompt => "Selecione um cliente" }, { :class=>'form-control'}) %>