app/views/painel/sales/index.html.erb

                  <td>
                    <% p.products.each do |p| %>
---
SELECT "products".* FROM "products" INNER JOIN "order_products" ON "products"."id" = "order_products"."product_id" WHERE "order_products"."sale_id" = ?  [["sale_id", 1]]