app/controllers/painel/dashboard_controller.rb

  def index
    @client = Client.new
    @product = Product.new
    @clients = Client.order('id DESC').limit(10)
    @sale = Sale.new
    @sales = Sale.order('id DESC').take(10)
---
SELECT  "clients".* FROM "clients"  ORDER BY id DESC LIMIT 10
SELECT  "sales".* FROM "sales"  ORDER BY id DESC LIMIT 10