app/controllers/painel/products_controller.rb

SELECT "products".* FROM "products" WHERE (quantify > 0)
---
  def index
    @products = Product.where("quantify > 0")

INSERT INTO "products" ("sku", "name", "price", "quantify", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sku", "102345"], ["name", "Produto 01"], ["price", 20.0], ["quantify", 2], ["category_id", 1], ["created_at", "2016-03-29 21:37:56.819670"], ["updated_at", "2016-03-29 21:37:56.819670"]]
---
  def create
    @product = Product.new(product_params)
    respond_to do |f|
      if @product.save